{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<|startoftext|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<|endoftext|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<|unk|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<|pad|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "<r>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 5,
      "content": "<b>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": {
    "type": "BPEDecoder",
    "suffix": "</w>"
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "<|unk|>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<|startoftext|>": 0,
      "<|endoftext|>": 1,
      "<|unk|>": 2,
      "<|pad|>": 3,
      "<r>": 4,
      "<b>": 5,
      "0": 6,
      "1": 7,
      "2": 8,
      "3": 9,
      "4": 10,
      "5": 11,
      "6": 12,
      "7": 13,
      "8": 14,
      "9": 15,
      "<": 16,
      ">": 17,
      "A": 18,
      "B": 19,
      "C": 20,
      "D": 21,
      "E": 22,
      "F": 23,
      "G": 24,
      "H": 25,
      "I": 26,
      "J": 27,
      "K": 28,
      "b": 29,
      "r": 30,
      "11": 31,
      "10": 32,
      "K11": 33,
      "A1": 34,
      "D8": 35,
      "H4": 36,
      "F7": 37,
      "F5": 38,
      "G5": 39,
      "E7": 40,
      "F6": 41,
      "G6": 42,
      "E6": 43,
      "E5": 44,
      "G7": 45,
      "F8": 46,
      "F4": 47,
      "G4": 48,
      "E8": 49,
      "H6": 50,
      "D6": 51,
      "E4": 52,
      "G8": 53,
      "D5": 54,
      "H7": 55,
      "H5": 56,
      "D7": 57,
      "K1": 58,
      "A11": 59,
      "G3": 60,
      "E9": 61,
      "H3": 62,
      "D9": 63,
      "I3": 64,
      "C9": 65,
      "I4": 66,
      "C8": 67,
      "I5": 68,
      "C7": 69,
      "D4": 70,
      "H8": 71,
      "F3": 72,
      "F9": 73,
      "B10": 74,
      "J2": 75,
      "C6": 76,
      "I6": 77,
      "J1": 78,
      "B11": 79,
      "H9": 80,
      "D3": 81,
      "D10": 82,
      "H2": 83,
      "C4": 84,
      "I8": 85,
      "G9": 86,
      "E3": 87,
      "C5": 88,
      "I7": 89,
      "G1": 90,
      "E11": 91,
      "H1": 92,
      "D11": 93,
      "F1": 94,
      "F11": 95,
      "E1": 96,
      "G11": 97,
      "I11": 98,
      "C1": 99,
      "I1": 100,
      "C11": 101,
      "B1": 102,
      "J11": 103,
      "G2": 104,
      "E10": 105,
      "B8": 106,
      "J4": 107,
      "I2": 108,
      "C10": 109,
      "H11": 110,
      "D1": 111,
      "C3": 112,
      "I9": 113,
      "J3": 114,
      "B9": 115,
      "F2": 116,
      "B7": 117,
      "F10": 118,
      "J5": 119,
      "A10": 120,
      "K2": 121,
      "A2": 122,
      "K10": 123,
      "J6": 124,
      "B6": 125,
      "K5": 126,
      "A7": 127,
      "A8": 128,
      "K4": 129,
      "E2": 130,
      "G10": 131,
      "K7": 132,
      "A5": 133,
      "A6": 134,
      "K6": 135,
      "K9": 136,
      "A3": 137,
      "A9": 138,
      "K3": 139,
      "J7": 140,
      "B5": 141,
      "K8": 142,
      "A4": 143,
      "I10": 144,
      "C2": 145,
      "H10": 146,
      "D2": 147,
      "J10": 148,
      "B2": 149,
      "J9": 150,
      "B3": 151,
      "J8": 152,
      "B4": 153
    },
    "merges": [
      "1 1",
      "1 0",
      "K 11",
      "A 1",
      "D 8",
      "H 4",
      "F 7",
      "F 5",
      "G 5",
      "E 7",
      "F 6",
      "G 6",
      "E 6",
      "E 5",
      "G 7",
      "F 8",
      "F 4",
      "G 4",
      "E 8",
      "H 6",
      "D 6",
      "E 4",
      "G 8",
      "D 5",
      "H 7",
      "H 5",
      "D 7",
      "K 1",
      "A 11",
      "G 3",
      "E 9",
      "H 3",
      "D 9",
      "I 3",
      "C 9",
      "I 4",
      "C 8",
      "I 5",
      "C 7",
      "D 4",
      "H 8",
      "F 3",
      "F 9",
      "B 10",
      "J 2",
      "C 6",
      "I 6",
      "J 1",
      "B 11",
      "H 9",
      "D 3",
      "D 10",
      "H 2",
      "C 4",
      "I 8",
      "G 9",
      "E 3",
      "C 5",
      "I 7",
      "G 1",
      "E 11",
      "H 1",
      "D 11",
      "F 1",
      "F 11",
      "E 1",
      "G 11",
      "I 11",
      "C 1",
      "I 1",
      "C 11",
      "B 1",
      "J 11",
      "G 2",
      "E 10",
      "B 8",
      "J 4",
      "I 2",
      "C 10",
      "H 11",
      "D 1",
      "C 3",
      "I 9",
      "J 3",
      "B 9",
      "F 2",
      "B 7",
      "F 10",
      "J 5",
      "A 10",
      "K 2",
      "A 2",
      "K 10",
      "J 6",
      "B 6",
      "K 5",
      "A 7",
      "A 8",
      "K 4",
      "E 2",
      "G 10",
      "K 7",
      "A 5",
      "A 6",
      "K 6",
      "K 9",
      "A 3",
      "A 9",
      "K 3",
      "J 7",
      "B 5",
      "K 8",
      "A 4",
      "I 10",
      "C 2",
      "H 10",
      "D 2",
      "J 10",
      "B 2",
      "J 9",
      "B 3",
      "J 8",
      "B 4"
    ]
  }
}